{
  "修谱名录": [
    "本次族谱重修，汇聚了众多族人的心血与支持。从倡议发起，到资料搜集、编纂校对，历时数载，终得圆满。为铭记功绩，特将主要参与人员名录公布如下，以示感谢与纪念。",
    "修谱发起人：杨洪兵",
    "修谱总负责人：杨勇、杨志、杨友昌",
    "委员会成员：\n杨洪兵（18182310821）、杨洪游（17783580213）、杨洪文（15523000828）、\n杨洪平（13611391961）、杨洪高（18223986377）、杨勇（13635332830）、\n杨志（18908269558）、杨友昌（15023834237）、杨文波（15730685240）",
    "主编：杨勇、杨志、杨友昌、杨號、杨文波",
    "网页设计：杨文波",
    "特别鸣谢：杨洪海、龙静",
    "片区负责人：\n安阳：杨洪平、杨洪文\n柳木：杨洪祥、杨贵昌\n中坝：江福兵"

  ],
  "谱首": {
    "序言": "国有史，方有志，家有谱。族谱者，家族之史记也。溯吾族渊源，自先祖开基以来，历数代耕耘，或耕读传家，或经商置业，或仕宦报国，虽迁徙流转，然血脉相承、家风未改。忠孝传家之训，勤俭持业之风，早已融入族人骨血，成为世代相守之根本。\n岁月流转，人事更迭。近年族中贤达常念及：族史散轶则根源难溯，宗亲离散则情谊渐疏。遂倡议重修族谱，以辑录先祖事迹、厘清世系脉络、联结宗亲情谊。此举既为告慰先人，亦为启迪后辈——知来处，方能明去处；晓家风，方得正己行。\n今集全族之力，访耆老、查旧籍、录新支，历时数载，终成此谱。其间或有疏漏，盼后世贤达补正。愿吾族后人，观此谱而念祖德，承家风而励己行，同心同德，继往开来，使吾族门楣愈盛，家声永续。",
    "修谱目的": "修族谱之目的，非仅为辑录姓名、罗列世系，实乃承前启后、凝聚族心之大业。细究其义，可从以下五方面观之：\n一、溯根源，明世系：族谱最根本之责，在于厘清家族血脉脉络。先祖迁徙开基、支系分衍传承，皆可于谱中寻得踪迹。修谱如为家族立\"基因图谱\"，让后人知晓\"我是谁、来自哪里\"，从根源上筑牢家族身份认同，使传承有章可循。\n二、传家风，承祖德：家族之魂，在于家风与祖德。族谱不仅载人名，更录先祖德行事迹：耕读传家、乐善好施、忠勇报国、治学有成等。修谱时将其系统整理，实则为后人树立修身范本，让子孙从先祖言行中悟得为人处世之道，将\"孝悌、诚信、勤俭、担当\"等家风代代相传。\n三、联宗亲，聚族心：家族成员散居各地，往来渐稀，情谊易淡。修谱过程本身便是一场\"寻亲之旅\"，能让疏远的宗亲重新建立联系，唤醒\"同根同源\"的认同感。族谱修成后，族人无论身处何方，翻阅谱牒时便知\"四海之内皆兄弟\"，从而增进宗族凝聚力，形成互帮互助的合力。\n四、存史实，补方志：家族史是国史、方志的微观缩影。族谱中记载的迁徙路线、职业变迁、婚丧习俗等，往往能为地方史研究提供珍贵资料。修谱不仅为家族留史，更为后人从家族视角窥见时代变迁轨迹。\n五、警后世，励来者：族谱并非\"尘封的旧纸\"，更需面向未来。修谱时除记录过往，亦载明家族现状，既是对先辈奋斗成果的总结，更是对后辈的鞭策。同时收录族规家训，为家族长远发展划定方向，确保基业长青。",
    "族规": "国有国法，家有家规。为正家风、睦宗族、育后人，使我族薪火相传、家声远扬，特立此规，望族人共勉遵守。\n1. 孝亲敬长，敦睦亲情：(1) 父母养育之恩，当尽心侍奉。(2)宗族长辈，无论亲疏，皆应恭敬礼遇，聆听教诲；同辈之间，互敬互让，守望相助。(3)夫妻相敬如宾，互谅互爱，共担家计；兄弟姊妹手足情深，勿争家产，勿结嫌隙。\n2. 修身立德，品行端正：(1) 为人当正直诚信，不欺瞒、不诈伪，言出必行，诺出必践，勿贪小利而失大义。(2) 戒骄戒躁，戒奢戒淫，杜绝酗酒、赌博、斗殴等恶习，不涉违法乱纪之事。(3) 待人以善，邻里和睦，乡邻有难则量力相助，不搬弄是非，不结怨仇。\n3. 耕读传家，崇文重教：(1) 良田勤耕则衣食足，学业勤修则才智增。无论务农、务工、经商，皆需勤勉务实。(2) 重视子女教育，督促勤学向善，虽家贫亦不可废学，使后辈明事理、通古今。(3) 族中子弟若有勤学上进、考取功名或成就学业者，家族当予以表彰鼓励。\n4. 遵纪守法，家国同怀：(1) 恪守国家法令，不犯刑律，不违公序良俗，做守法公民，为家族增光。(2) 心系家国，遇国家征召、社会公益，当踊跃参与，尽显担当。(3) 爱护族中公共祖产（如祠堂、祖坟、族田等），不可私自侵占或损毁。\n5. 慎终追远，传承家风：(1) 每年清明、冬至等节，需依时祭扫先祖，缅怀祖德，讲述家族历史。(2) 族谱乃家族血脉所系，需妥善保管，定期续修，新增人口、重要事迹及时录入。(3)凡族人婚嫁、迁徙、重大成就或过失，应报知族长或族中管事，载入族册。\n6. 违规惩戒，奖惩分明：(1) 族中子弟若恪守族规、品行端方、有功于家族者，由族长召集族人公开表彰。(2) 若有违族规者，视情节轻重，由族长与族中长老商议处置：轻则训诫警告，重则通报全族。",
    "家训": "1. 孝悌为本，仁爱为怀：(1) 百善孝为先，孝亲敬长乃立身之本。(2) 兄弟姊妹，手足情深，患难相扶，富贵相济。(3) 以仁爱之心待人，以慈悲之怀处世。\n2. 诚信立身，勤俭持家：(1) 诚信乃立身之本，言出必行，诺出必践。(2) 勤俭节约，珍惜物力，居家量入为出，处世清廉自守。(3) 戒骄戒躁，戒奢戒淫，以德修身，以俭养德。\n3. 勤学上进，报效家国：(1) 学而时习之，不亦说乎。勤学向善，不可因家贫而废学。(2) 尊师重道，虚心求教，学有所成当报效家国，惠及乡族。(3) 耕读传家，无论务农、务工、经商，皆需明事理、知荣辱。\n4. 团结互助，和睦乡邻：(1) 同根同源，血脉相连，无论散居何地，皆存\"一本同源\"之念。(2) 乡邻和睦，以善待人，不搬弄是非，不侵占邻里利益。(3) 遇纷争当忍让，必要时由族中长辈调解，以和为贵。\n5. 传承家风，光耀门楣：(1) 传承先祖美德，弘扬家族精神，让家风代代相传。(2) 以先祖为榜样，以家族为荣，为家族增光添彩。(3) 继往开来，让家族门楣愈盛，家声永续。"
  },
  "先祖溯源": {
    "姓氏渊源": "杨氏，华夏古姓，源于姬姓。周宣王时，伯侨被封于杨国（今山西洪洞），其后裔以国为姓。吾族岳州支系，世居湖广岳州府巴陵县（今湖南岳阳岳阳楼周边），环洞庭而居，历宋元明三代，已为当地望族。",
    "祖德传略": "木易杨氏，溯其渊源，乃华夏古姓，支脉星布。吾族岳州支系，世居湖广岳州府巴陵县（今湖南岳阳岳阳楼周边），环洞庭而居，历宋元明三代，已为当地望族。族中以“耕读传家、孝悌立身”为训，祠堂悬“四知堂”匾额（取杨震“天知、地知、你知、我知”典故），子弟多习儒业，农闲则聚于族学，故乡邻有“杨家文风盛”之誉。\n\n一、迁徙之由：从洞庭之畔到蜀地之念\n明末清初，巴蜀历经张献忠之乱、清军入川等兵燹，“千里无烟，白骨露于野”（《巴县志》载）。至康熙初年，清廷为恢复蜀地生机，颁布“湖广填四川”诏：“凡愿入川者，免赋税五年，授田亩，准入籍”。消息传至岳州，正值当地“人稠地隘，十年九涝”——洞庭水患频发，堤岸溃决时，良田尽毁，族人多有饥馑之苦。康熙四十九年（1710 年），族中长老杨宏道（时年六十二）召集各房议事，言：“吾族居岳州七代，然水患不绝，子弟无田可耕，非长久计。闻蜀地巫溪，山高水长，土肥人稀，诚拓业之地也。”众议纷纭，杨成武携子，时年二十五的杨启宗（宏道公长孙）力排众议：“先祖杨震公言‘清白传家，然无立锥之地，何谈传家？愿率族西行，为子孙谋基业！”终得族中十六户响应，共推启宗公为迁徙首领。\n\n二、万里迁徙：半载风霜，九死一生\n康熙五十二年（1713 年）正月十六，启宗公率族人启程。行前，宏道公捧族谱付启宗：“此乃家族命脉，宁失行李，不可失谱！”又取祠堂香炉一瓣：“携此，如先祖在侧。”族人皆披麻戴孝，跪拜祖祠，哭别乡邻，沿洞庭湖入长江，乘三艘木船溯流而上。船过荆江，遇“险滩十八”，其中“鬼见愁”滩水流湍急，木船触礁，半船粮食坠入江底，启宗公之弟启茂（年二十）为护族谱，被浪头卷走，尸身无寻——族人在滩头焚纸哭祭，刻“杨公启茂溺难处”于礁石，至今尚存（今湖北宜昌境内）。抵夔州府（今重庆奉节）后弃舟登岸，沿古盐道向巫溪进发。时逢梅雨，山路泥泞，老幼多染脚气，溃烂流脓；族中孕妇李氏（启华公之妻）临盆于山洞，诞下一子，取名“洞生”，以记其事。行至巫溪境内“黑风口”（今徐家镇与白鹿镇交界处），遇山匪劫掠，启宗公以随身携带的岳州茶油（备作盘缠）贿匪，方得脱险，然半数衣物、农具被抢。五月廿三，历经一百二十六日，余二十七口（途中病逝二人、溺亡一人）终见徐家坝——彼时坝上茅草丛生，仅有三户土著（冉姓、向姓），见来人衣衫褴褛却捧族谱不放，皆叹“此族重根”。\n\n三、扎根徐家：辟荒建村，渐成望族\n启宗公向巫溪县衙报备入籍，得“荒地百亩，准永为业”文书。族人伐木为屋，先搭十三间草棚，分“男女老少”四舍居住；又合力开垦荒地，因岳州习种水稻，而徐家坝多旱地，便向冉姓土著学种玉米、洋芋，“晨兴理荒秽，带月荷锄归”，首年秋收得玉米三百余石，终免饥寒。康熙五十六年（1717 年），启宗公率人在坝中高岗建“杨氏宗祠”三间瓦房，中供岳州始祖牌位，左设“迁川始祖启宗公”神位，右悬迁徙路线图。每年冬至，全族聚祠，由长老诵读族谱，讲述“黑风口遇匪”“洞生诞生”等往事。雍正二年（1724 年），启宗公在宗祠旁设“启蒙学馆”，聘巫溪秀才张秉文执教，族中子弟不论贫富皆可入学，外姓孩童愿来者亦不拒。又与冉、向二姓共修“三眼井”，解决饮水难题，约定“分时段取水，不得相争”，自此“杨、冉、向，一家亲”的民谣在徐家坝流传。\n\n四、启华公五世孙杨清山家族迁徙历程与后世发展\n咸丰初年的巫溪，天灾人祸交织：白鹿烂泥湾的土地贫瘠，一遇大旱又颗粒无收，再加上官府催缴赋税如狼似虎，地方匪患趁乱劫掠，杨清山一家的日子早已撑不下去。无奈之下，杨清山只能带着族人离开世代居住的烂泥湾，辗转求生。最终在徐家龙洞包落脚，开垦坡地，勉强度日。可随着五个儿子相继成家，人口激增，土地不敷使用。最终杨清山咬牙决定：分家！让五个儿子各带家人，往不同的地方找活路。长子杨正刚迁至徐家、贺院子、柳木、塘垭和肖家一带，靠着茂溪河水源，将河滩荒地改造成良田，家业渐兴，到光绪年间已田地上百亩，其后人或守业，或开新田，或在徐家街开米行，人丁兴旺，成为当地大族，其孙杨绪礼1951年参军入党，在大凉山剿匪，为国贡献，是家族中传承红色精神的活化石；次子杨正纪选择三河地区（今安阳），他带领家人改良沙质土，开挖水渠引山泉水灌溉，将“望天收”的旱地变成水田，后代沿袭其法，向三河下游拓展，靠“水渠+梯田”模式站稳脚跟，在当地颇有威望；三子杨正尚在徐家大阳坡落脚，靠山地种杂粮、做竹编为生，子孙逐渐散到下沙坝、关庙附近；四子杨正品因太平军过境、兵荒马乱与家族失联，再无音讯；五子杨正德看中中坝乡的安稳，在山区与河谷过渡带开垦坡地，种玉米、水稻，慢慢形成聚居点。分家后的几支后人，在徐家周边的土地上勤恳耕作，扛过了战乱、灾荒。随着时代变迁，杨清山的后人早已不是单纯的农户，通过读书、经商、学艺等方式，走向了重庆、成都等大城市，在各行各业安家立业。如今，杨清山的子孙遍布各地，但“五年合修族谱、十年共祭先祖”的传统仍在，家族的凝聚力未曾消减。" 
  },
  
  "字辈谱序": "这部分为了更好展示风格直接写在html中了",


  "族人传略": [
    {
      "姓名": "刘伍秀",
      "关系": "杨绪堂之妻",
      "出生年份": 1930,
      "简介": "刘伍秀，一位生于1930年的坚韧女性，重庆市巫溪县徐家镇人，是杨清山之曾孙杨绪堂的妻子。在漫长的岁月里，刘伍秀以务农为业，将勤劳深深烙印在生活的每一处。无论是骄阳似火的盛夏，还是寒风凛冽的冬日，她都雷打不动地穿梭于田间。播种时，她弯腰屈膝，仔细地将一颗颗种子埋进土里，仿佛种下了全家的希望；除草时，她不辞辛劳，不放过任何一株杂草，只为庄稼能茁壮成长；收割时，她更是挥洒着汗水，将丰收的果实收入囊中，那满是老茧的双手见证着她的勤劳。生活中，她节俭到了极致：一件衣服缝缝补补穿多年，洗菜水留着浇地，夜晚非必要绝不点灯，吃时饭碗里的每一粒米都要吃干净，从不肯浪费分毫。\n\n养育两女三子的岁月，更是她用血汗铺就的路。在物资匮乏的年代，全家的温饱压得她喘不过气。白天在田里拼命干活，傍晚背着沉甸甸的柴火回家，顾不上擦汗就生火做饭，稀粥里总要给孩子们多捞些米粒，自己则常以野菜充饥。夜里孩子们睡熟后，她还在油灯下缝补衣服，老大穿小的改给老二，袖口磨破了就加块补丁，针脚里藏着她对孩子们的疼惜。哪个孩子生病了，她更是连夜背着往镇上跑，山路崎岖难行，她的脚步却从未迟疑，哪怕自己累得几夜不合眼，也要守到孩子退烧。她常说“再难也要供娃识字”，省吃俭用攒下的钱，全花在了孩子们的学费上，自己却多年没添过一件新衣裳。\n\n如今，95岁的刘伍秀满头银发，身体硬朗得让人惊叹：生活完全自理，扫地洗衣样样利索，爬三楼不喘气，连常见的老年病都没沾边，更无需家人贴身照料。而她当年含辛茹苦养大的两女三子，如今已在不同城市、不同行业扎根，有的成了技术骨干，有的经营着小生意，个个家庭和睦、衣食无忧。孩子们常说：“没有妈当年那股子拼劲，就没有我们今天的日子。”这份勤劳与坚韧，不仅让她收获了健康的晚年，更成了子女心中最珍贵的家风传承。"
    },
    {
      "姓名": "杨绪礼",
      "关系": "杨正刚之孙",
      "出生年份": 1932,
      "简介": "杨绪礼，一位生于1932年的坚韧男性，重庆市巫溪县徐家镇人，是杨清山长子杨正刚之孙。作为家族迁徙后扎根乡土的第三代，他自幼在农耕生活中磨砺出坚韧品格。1951年，19岁的他响应国家号召参军入伍，毅然奔赴四川大凉山参与剿匪任务。彼时的大凉山环境恶劣、斗争复杂，他始终坚守军人职责，在多次行动中冲锋在前，以无畏的勇气和务实的作风投身清剿工作，为安定地方秩序、保障群众生产生活筑牢了坚实防线，同年光荣加入中国共产党，党龄至今已逾70年。\n\n退伍返乡后，杨绪礼始终以共产党员的初心践行使命，将部队锤炼的纪律意识与奉献精神融入家乡建设。他扎根基层，积极参与地方公益事业，在修桥铺路、调解邻里矛盾等事务中主动担当，以公道正派的行事风格赢得乡邻信赖。在家庭中，他尤为重视家风传承，将“对党忠诚、为民担当、勤俭持家”的理念贯穿子女教育始终，既严格要求后辈品行端正，又鼓励他们勤学实干、服务社会。他悉心培养的二子四女，均成长为品行端方、各有所成的栋梁之材，在各自领域践行着家族的责任与担当。\n\n如今，已90多岁高龄的杨绪礼依然精神矍铄，虽年事已高，仍时常关注家乡发展与家族传承。他的人生轨迹，既印刻着个人在时代浪潮中的奋斗印记，也折射出家族从颠沛求生到安稳发展的历程，成为家族中传承红色基因与优良家风的鲜活象征，深受族人及乡邻的敬重。他的事迹早已超出家族范畴，成了徐家镇周边十里八乡公认的榜样——人们提起他，总会说：“杨老兵这辈子，就像茂溪河里的石头，看着不起眼，却把水流导得更顺，把河岸护得更牢。”"
    },
    {
      "姓名": "杨洪兵",
      "关系": "杨绪清之子",
      "出生年份": 1946,
      "简介": "杨洪兵，一位生于1946年的朴实男性，重庆市巫溪县徐家镇唐垭云盘村人，是杨绪清之子；妻子陈定香，1946年生，二人现年80岁，身体硬朗，精神状态良好。在职业与社会职务方面，杨洪兵早年积极投身基层工作：19岁担任生产队队长，20岁起兼任肖家团支部书记与民兵连长，38岁至50岁期间任职肖家村村长，在不同基层岗位上认真履职，承担地方建设相关职责。衷于家族事业，始终用心维系家族情感与发展，凭借多年的担当与付出，成为当地德高望重的老人；陈定香则以坚韧与包容操持家务、维系家庭，二人的品格深刻影响着后辈成长。"
    },
    {
      "姓名": "杨洪高",
      "关系": "杨绪义之子",
      "出生年份": 1955,
      "简介": "杨洪高，一位生于1955年的坚毅男性，重庆市巫溪县白鹿区黄家公社人，是杨绪义之子。16岁时，他怀着赤诚之心响应国家号召应征入伍，成为四川省军区独立第五团的一名战士，开启了6年的军旅生涯。在部队期间，他被分配至团部电台担任报务员，负责通信保障工作。这份工作对精准度和专注力要求极高，也让他在日复一日的信号收发中，养成了严谨细致、沉稳可靠的行事风格，更锤炼出极强的责任心与纪律性。1977年从部队退役返乡后，杨洪高凭借军人特有的魄力与闯劲，果断投身商海，在重庆巫溪本地及湖北、陕西周边区域涉足木材生意。数十年来，他始终坚守诚信经营的原则，无论是对接货源、洽谈合作，还是把控木材质量，都以务实肯干的态度深耕领域。面对不同地区的市场差异与经营挑战，他总能凭借灵活的应变能力和坚韧的毅力妥善应对，不仅在行业内积累了良好口碑，也让这份事业得以长久延续，成为他人生中不可或缺的重要篇章。"
    },
    {
      "姓名": "杨洪齐",
      "关系": "杨绪堂之子",
      "出生年份": 1963,
      "简介": "杨洪齐，一位生于1963年的实干男性，重庆市巫溪县徐家镇高宏村五组人，是杨绪堂之子。他自18岁起便投身木工行业，凭借对技艺的专注与钻研，练就扎实的木工功底，熟练掌握家具制作、木材加工等全流程操作。在个人生活与家庭建设中，杨洪齐稳步前行：1985年妥善处理个人婚姻事宜，组建家庭；1986年长子出生，1993年次子降临，家庭愈发圆满。1995年，为寻求更好的发展机遇，他带着全家搬迁至湖北省十堰市竹溪县城关镇。初到异乡，面对人生地不熟、资源有限的困境，他始终坚守木工本行，以过硬的技术和踏实的态度直面挑战，逐步在当地站稳脚跟，积累了丰富的行业经验与客户资源。从青年到老年，杨洪齐将四十余载光阴倾注于木工事业，靠实干实现了事业的稳定发展；同时，他用心经营家庭，成功培养出两名优秀后人。如今，他已正式退休，卸下了奋斗半生的木工工具，在享受安稳生活的同时，也为自己用坚持、责任与实干书写的人生篇章，画上了圆满句号。"
    },
    {
      "姓名": "杨洪游",
      "关系": "杨绪礼次子",
      "出生年份": 1964,
      "简介": "杨洪游，一位生于1964年的踏实男性，重庆市巫溪县徐家乡高洪村人，是杨绪礼的次子。乡土的滋养赋予了他朴实稳重、踏实负责的品格。1983年7月，他从巫溪县城厢中学高中毕业，在校期间打下了扎实的学业基础，养成了认真细致、有始有终的做事习惯。自1986年9月踏入职场以来，杨洪游数十年如一日深耕金融领域，始终以稳健和担当走好每一步。他最初担任高竹乡信用社会计主任，以严谨细致的态度处理每一笔账务；1990年1月调任易溪乡信用社主任，开始承担管理职责，耐心协调各项事务；1992年1月转任徐家信用社主任后，始终贴近群众需求，用心保障乡镇金融服务。1995年9月，在信用社与农行脱钩的关键时期，他被委以白鹿区办事处主任的重任，主管八个乡镇信用社工作，在此岗位坚守六年，以大局为重，稳妥推进各项工作。2001年11月调任重庆市大渡口区联社营业部主任，面对新环境迅速适应、主动作为；2012年调入联社机关后，依然保持勤勉务实的作风，直至2024年8月光荣退休。生活中，他为人谦和稳重，做事踏实而有韧劲。工作中始终秉持公正廉洁的原则，处事透明规范；生活中心系家族，常常为促进亲人团结而默默奔走，无论是调解家庭矛盾还是组织家族聚会，总能用行动凝聚情感，成为亲友心中值得信赖的“主心骨”。退休后，他将更多时间用于陪伴和照顾年迈的父母，以真挚的陪伴传递孝道与温情。"
    },
    {
      "姓名": "杨洪文",
      "关系": "杨绪元长子",
      "出生年份": 1966,
      "简介": "杨洪文，一位生于1966年的勤勉男性，重庆市巫溪县徐家镇安阳村1社人，是杨绪元的长子。他幼年便养成吃苦耐劳、勤学苦干的品格，为谋生计拜师学艺，在反复磨练与摸索中熟练掌握木匠手艺。此后，他凭借这门手艺漂泊于各个城镇，以精湛技艺支撑起全家生活。随着社会发展，二十多岁的杨洪文开启北漂生涯。受限于文化水平，他起初难以找到薪资可观的工作，但始终秉持“勤奋肯干终会出头”的信念。历经数年打拼，他逐步积累人脉与行业经验，在家人的支持下，毅然转型开启工地承包事业。从最初仅几人的小队伍，到后来发展为几十人的团队，期间虽遭遇诸多困难，他却始终坚守，一干便是四十余年，最终在创业道路上收获颇丰。如今，杨洪文已退居二线，尽享儿孙满堂的幸福生活。他的经历印证了：即便没有强大背景、高学历与雄厚资本，凭借自身的努力、勤奋与踏实肯干，亦能在人生道路上闯出一片天地，收获属于自己的成功。"
    },
    {
      "姓名": "杨洪平",
      "关系": "杨绪忠次子",
      "出生年份": 1969,
      "简介": "杨洪平，一位生于1969年的坚韧男性，重庆市巫溪县徐家镇安阳村人，是杨绪忠的次子。成长于乡土之间，自小养成坚韧务实的品性。18岁前，他扎根家乡参与农业生产，在田间劳作中锤炼出吃苦耐劳的精神；18岁至27岁，为寻求更好发展，他远赴甘肃兰州煤矿务工，在艰苦的工作环境中积累生活阅历与奋斗力量。1996年起，他前往北京发展，至今扎根京城多年，凭借不懈的个人努力与踏实打拼，逐步改善生活条件，不仅实现了个人价值，更切实改变了家人的生活质量，用行动诠释了奋斗的意义。在为人处世方面，杨洪平以耿直爽快的性格、真诚慷慨的态度赢得身边人的认可，始终顾大局、识大体，无论是对待族人还是朋友，都能做到团结互助。他尤其热心家族事业，在家族修谱等重要事宜中积极奔走、主动支持，以实际行动助力家族文化传承，尽显责任与担当。"
    },
    {
      "姓名": "杨昌全",
      "关系": "杨洪波之子",
      "出生年份": 1969,
      "简介": "杨昌全，一位生于1969年的坚毅男性，重庆市巫溪县徐家镇人，是杨洪波之子，中共党员，退伍军人，优秀企业家，现为惠州市全方五金制品有限公司创始人及主要负责人。他自幼在徐家镇成长，1975年入读徐家小学，后毕业于白鹿中学。家乡的生活与教育经历塑造了他朴实坚韧、勤奋务实的品格。1989年3月，杨昌全自徐家镇应征入伍，服役于云南成都军区守备一师独立二营一连，曾参与中越边境自卫反击作战，在战火中践行了保家卫国的使命。1990年3月，他因表现优异光荣加入中国共产党，并于同年起至1992年10月退伍期间担任连队文书，以严谨细致的作风圆满完成各项任务。军旅生涯锤炼出他坚强的意志、高度的责任感和卓越的执行力。1992年退伍后，杨昌全前往广东发展，从基层岗位做起，逐步积累行业经验与社会资源。1996年，凭借敏锐的市场洞察和军人敢闯敢干的魄力，他在广东惠州小金口创办“惠州市世通五金制品有限公司”（后发展为惠州市全方五金制品有限公司）。创业以来，他始终秉持诚信为本、务实拼搏的军人作风，深耕五金制造行业，带领企业稳步成长，在业界树立了良好声誉，成功实现了从军人到企业家的转型。杨昌全的人生历程，是从家乡少年成长为戍边卫士，再到创业先锋的奋斗缩影，展现出坚韧不拔、勇于开拓的时代精神。"
    },
    {
      "姓名": "杨昌元",
      "关系": "杨洪清长子",
      "出生年份": 1974,
      "简介": "杨昌元，一位生于1974年的坚韧男性，重庆市巫溪县徐家镇安阳村人，是杨洪清的长子。他幼年家境贫寒，且父母早逝，早早便扛起生活重担，在逆境中养成坚韧不拔的品性。为改变生活现状，杨昌元早年外出打工，始终秉持勤奋刻苦的态度，一边谋生一边钻研手艺，不断提升自身能力。在煤矿工作期间，他常年早出晚归、24小时待命，从无偷懒耍滑，工作之余还坚持学习新技能，始终保持进取之心。凭借多年在外的拼搏与积累，他于2013年在徐家镇平安路建成新房，用实干改善了生活。生活中的杨昌元热心仗义，面对工友、邻居及亲友的困难，总能主动伸出援手；遇到领导不合理指挥时，他敢于带头沟通理论，全力保障工友的权益与安全。此外，他亦十分关注家族事业，在族谱编纂、祖坟修缮等事宜中积极出力，以实际行动维护家族团结，深得族人钦佩，是为家族奉献的杰出代表。"
    },
    {
      "姓名": "杨美俊（湖北十堰）",
      "关系": "杨洪兵之女",
      "出生年份": 1975,
      "简介": "杨美俊，一位生于1975年的坚韧女性，重庆市巫溪县人，是杨洪兵之女。1993年7月，她嫁至湖北省十堰市竹溪县，此后便在此扎根生活。1996年，杨美俊迎来家庭的第一个重要时刻，长子出生；2005年，次子的降生让家庭更加圆满，她也始终维系着和睦的家庭氛围。事业上，2003年是她的关键转折点，她在竹溪县城关镇自主创业“重庆美静烤鱼”，开启创业之路。凭借独特口味与用心经营，2013年，该品牌通过竹溪县史志办考核，成功载入县志，成为当地饮食文化的代表性符号之一。截至2025年，“重庆美静烤鱼”已陪伴竹溪县民22年，成长为当地家喻户晓的知名品牌。在外地发展的竹溪人心中，它更是家乡味道的象征——“早餐想竹溪的包子，夜宵就想吃重庆美静烤鱼”，这句话便是其口碑的生动写照，如今店铺生意依旧兴隆。"
    },
    {
      "姓名": "杨银昌",
      "关系": "杨洪贵之子",
      "出生年份": 1976,
      "简介": "杨银昌，一位生于1976年的坚韧男性，重庆市巫溪县徐家镇安阳村人，是杨洪贵之子。早年因父亲去世、家庭条件受限，读完小学后便无奈辍学，过早承担起生活压力，也由此养成了坚韧肯干的品性。为谋生计，他17岁便踏入煤窑工作，在艰苦环境中磨砺数年；后续为寻求更多机会，前往广东进入制衣厂务工，积累了不同行业的基层经验；2010年至2014年，他在广东转型尝试养殖业，开启养鸭事业，探索新的发展方向；如今，他回到家乡徐家镇安阳村，在村后开展养猪业务，扎根故土继续以踏实劳作支撑生活，始终保持着为生计奔波、不断尝试的务实态度。在个人特质上，杨银昌最突出的是直面困境的韧性——面对早年家道中落、务工环境艰苦、跨界创业挑战，从未因困难退缩，始终以“能扛事”的态度咬牙坚持；同时具备强适应力与敢闯敢试的劲头，从煤窑到制衣厂，再到养殖业的两次转型，无论身处哪个行业、哪种环境，都能快速适应并专注投入；此外，他始终保持务实本分、勤恳坚韧的底色，无论是在外打拼还是回乡创业，皆以双手劳作立身，不投机取巧，用数十年的踏实付出撑起生活，也赢得身边人的认可。"
    },
    {
      "姓名": "杨美娟",
      "关系": "杨洪国之女",
      "出生年份": 1976,
      "简介": "杨美娟，一位生于1976年的温婉女性，重庆市巫溪县徐家镇唐垭街道人，是杨洪国（塘垭）之女；其丈夫熊正国，1974年出生，二人现居重庆市巫溪县徐家镇。求学阶段，杨美娟的学业生涯扎根徐家镇及巫溪县内。她先后在徐家镇的徐家小学、白鹿中学完成小学与初中学业，后进入巫溪中学读完高中。学习期间，她始终保持刻苦努力的态度，以积极阳光的心态投入学习，脚踏实地提升自我。工作与事业发展上，杨美娟高中毕业后，入职重庆市巫溪县徐家镇火力发电站。在电站工作期间，她与同事建立了良好关系，认真履行工作职责，凭借出色的表现赢得领导与同事的一致好评。此后，她与丈夫熊正国携手创业，在徐家镇共同创办了电器店、饮用水厂及农家乐等经营项目，为当地居民的日常生活、消费需求提供了切实便利。家庭生活中，杨美娟与熊正国育有一儿一女。作为母亲，杨美娟始终以家庭为重，悉心照料家人的生活起居，将小家庭经营得有声有色。在子女教育方面，她注重引导孩子树立正确价值观，时常教育子女要努力成为对国家有用的人，且要拥有一颗懂得感恩的心，为子女明确成长目标、实现长远发展奠定了坚实基础。"
    },
    {
    "姓名": "杨丽（杨昌萍）",
    "关系": "杨洪文（肖家）之女",
    "出生年份": 1979,
    "简介": "杨丽（杨昌萍），一位生于1979年的实干女性，重庆市巫溪县岔路人，是杨洪文（肖家）之女。她自2015年在苏州开启创业历程，近十年来持续深耕精密制造领域，目前统筹管理宿迁、昆山两大生产基地，核心业务聚焦于汽车结构件与医疗器械配件的研发与加工。在创业及企业运营过程中，她主导完成了两大生产基地的筹建与布局，逐步构建起标准化的生产流程和完善的组织架构，实现双地协同运作。通过引进100余台加工中心及配套专业测量设备，她建立起严格的质量管控体系，有效保障了产品精度与稳定性，满足汽车与医疗行业的高标准要求。杨丽始终专注主营业务，通过持续优化工艺流程和供应链管理，推动企业加工产能稳步提升，现已具备年均4000万元的产值能力，在精密制造领域积累了丰富的行业资源与项目管理经验。她具备从零起步构建生产体系的战略规划与运营管理能力，擅长多基地协同、团队建设与品质管控，能够有效统筹产能、成本与质量关系。基于多年行业深耕，她对汽车结构件与医疗器械配件的技术标准、工艺优化及市场需求具有深刻理解，并通过流程改进与资源整合，持续提升企业效益与市场竞争力。"
    },
    {
    "姓名": "杨勇（塘垭）",
    "关系": "杨洪国（塘垭）之子",
    "出生年份": 1979,
    "简介": "杨勇，一位生于1979年的担当男性，重庆市巫溪县人，是杨洪国（塘垭）之子。他于西南政法大学成人高等教育大专毕业，通过持续学习不断夯实专业基础。2001年至2003年，杨勇参军入伍，在部队期间严守纪律、刻苦训练，积极参与各项集体任务，不仅练就了强健体魄，更培养了高度的责任感、团队协作精神和高效执行力，形成了严谨务实、雷厉风行的工作作风。退伍后，杨勇凭借在部队锤炼出的优良素质，成功进入渝东北自来水公司工作，被分配至巫溪双通电站，主要负责日常运行维护、设备巡检、安全生产及技术保障等任务，始终以高度的责任心将军队的纪律意识与执行力融入岗位实践，严格遵循操作规程，有力保障了电站的安全稳定运行，为区域供水系统提供了可靠支持。杨勇为人踏实担当，既有军人的纪律性与责任感，也具备基层工作者务实肯干的品质，在日常生活中重视邻里关系，待人真诚热情，经常参与邻里互助，营造和谐融洽的社区氛围，同时热心家族事务，始终心系家族团结与发展，积极投入时间与精力参与各类家族活动，在需要时主动出谋划策、贡献力量，以实际行动维系家族情感，是亲友邻舍眼中值得信赖的实在人。"
    },
    {
    "姓名": "杨志",
    "关系": "杨洪国（安阳）之子",
    "出生年份": 1980,
    "简介": "杨志，一位生于1980年的担当男性，重庆市巫溪县人，是杨洪国（安阳）之子。作为家中长子，他在1999年父亲去世后主动承担起家庭重任，与母亲共同支撑全家，不仅在生活上悉心照顾母亲，也为弟弟树立榜样，成为家庭在经济与精神上的支柱，以长子的担当维系着家庭的稳定与延续。杨志于1996年完成初中学业，为尽早掌握谋生技能、减轻家庭负担，他选择进入技校学习，并将目标明确指向就业自立、补贴家用。技校毕业后，他放弃本地相对安逸的机会，毅然外出务工，以体力和技能换取收入，将大部分薪酬寄回家里，用于母亲的生活和弟弟的成长，独自承担起在外打拼的艰辛与牵挂。2015年，为更好地照顾母亲、就近支撑家庭，杨志决定返乡创业，与弟弟共同经营烤鱼摊，他踏实肯干，不断优化菜品口味，逐步将烤鱼摊发展为当地具有口碑的特色小吃，既实现了“顾家”与“创业”两不误，也为家庭提供了持续稳定的经济来源。杨志为人正直诚恳，无论在经营中还是家庭关系里，始终坚守诚信为本、处事公正，赢得了顾客与亲友的信任，他热心家族事务，多年来从外出务工到返乡创业，始终将家庭与亲情放在首位，以实际行动促进家族团结，展现出一以贯之的责任感与归属感。"
    },
    {
    "姓名": "吴应美",
    "关系": "杨勇之妻",
    "出生年份": 1982,
    "简介": "吴应美，一位生于1982年的聪慧女性，重庆市巫溪县人，是杨勇的妻子。她高中毕业后具备扎实的文化基础，为后续事业发展奠定了良好根基。她于2006年与杨勇组建家庭，在经营家庭的同时，逐步规划并拓展个人事业路径。2007年，她接手父母原经营的“喜得乐超市”，凭借敏锐的商业意识和踏实肯干的态度，积极优化超市的运营模式、商品结构及客户服务，使超市经营持续向好，积累了丰富的零售行业经验和稳定的客源。2021年，基于对市场趋势的深入洞察和多年零售经验的积累，她进一步推动产业升级，开设烟酒专卖店，通过精准选品、专业质量把控和精细化运营，新业务迅速在当地市场树立口碑，成为区域烟酒零售领域的佼佼者，展现出优秀的商业拓展与经营管理能力。吴应美具备出色的商业头脑与执行力，从传统超市经营到烟酒专卖升级，始终保持着对市场的敏感度和创新意识，她善于整合资源、优化运营，在零售行业中不断突破，体现出坚韧务实的创业精神和持续成长的发展潜力。"
    },
    {
    "姓名": "杨毅",
    "关系": "杨洪国（安阳）之子",
    "出生年份": 1983,
    "简介": "杨毅，一位生于1983年的坚韧男性，重庆市巫溪县人，是杨洪国（安阳）之子。1999年父亲去世后，因家境所限，他早早体会到生活的不易，也由此养成了坚韧踏实、勇于担当的品格，为日后学习技能、自主创业奠定了心态基础。他高中毕业后，为掌握一技之长、改善家庭生活，主动选择学习厨艺，在学习期间刻苦钻研，从食材处理到火候把控逐步积累经验，最终练就扎实的烹饪基本功，为创业打下坚实根基。学成之后，杨毅不断在实践中精进技艺，并逐步明确回乡发展的方向，2005年正式在徐家当地开设烤鱼摊，凭借独特的腌制配方、精准的烤制技巧和地道的调味风格，迅速赢得食客认可。此后二十余年间，他始终坚守摊位，持续优化口味，以稳定的品质和良好的口碑，使这个小摊成为徐家当地经营超过二十年的“老字号”，也成为区域内有辨识度的地标美食。杨毅为人坚韧务实，面对家庭困境不退缩，始终以技能谋发展、以坚持创口碑，他二十年如一日专注一事，展现出扎实的创业毅力与高度的责任心，不仅实现了个人价值，也为地方餐饮文化注入了持久的特色与温度。"
    },
    {
    "姓名": "杨东昌",
    "关系": "杨洪建（安阳）之子",
    "出生年份": 1985,
    "简介": "杨东昌，一位生于1985年的实干男性，重庆市巫溪县徐家镇安阳村人，是杨洪建（安阳）之子，现任惠州市全方五金制品有限公司法人代表兼经理。早年经历与教育方面，杨东昌先生出生于重庆巫溪的乡村，1992年时年7岁的他进入徐家小学接受启蒙教育，1998年13岁时升入白鹿中学继续学业。职业生涯上，2001年年仅16岁的杨东昌先生怀揣梦想，远赴广东开始自己的职业生涯，他早年曾在饭盒厂、线路板厂等多家企业工作，积累了丰富的基层生产与管理经验，通过不懈的努力与奋斗，他最终在五金制造行业扎根并取得了显著成就。目前，作为企业的创始人和领导者，他担任惠州市全方五金制品有限公司的法定代表人兼经理，全面负责公司的战略规划与运营管理。"
    },
    {
    "姓名": "杨友昌",
    "关系": "杨洪应之子",
    "出生年份": 1987,
    "简介": "杨友昌，一位生于1987年的实干男性，重庆市巫溪县徐家镇贺院子人，是杨洪应之子。早年经历了一段探索式的成长：初中毕业后进入大专学习，后因年少时的懵懂选择暂停学业，带着闯劲投身社会历练。走出校园后，他的人生轨迹充满烟火气与实干色彩——既在普通岗位上打磨过耐心，也敢闯敢试开启创业路：开过小店经商做买卖，全国各地跑市场、找货源，在与不同客户的打交道中摸清生意门道；也放下过“体面”，拿起刀当过屠夫、摆摊卖肉，在凌晨的市场与新鲜的食材里，体会过谋生的艰辛与踏实。此外，他还曾以水手的身份远航，在风浪与奔波中，更深刻地感受过生活的多元与广阔。多年跨界的经历，不仅让他走遍大江南北，更沉淀出务实的心态、灵活的应变能力与格外坚韧的性格。如今的他，早已褪去青涩，收获了圆满的家庭，儿女双全的幸福让他更懂责任与担当，生活稳定之余，他热心公益，常以实际行动传递温暖；面对家族事业，他也满怀热忱，愿将过往闯练出的经验与心力倾注其中，为家族发展贡献自己的力量。"
    },
    {
    "姓名": "杨滔",
    "关系": "杨洪忠之子",
    "出生年份": 1987,
    "简介": "杨滔，一位生于1987年的务实男性，重庆市巫溪县徐家镇高洪村1组人，是杨洪忠之子，他初中文化，现居重庆市巫溪县徐家镇高洪村1组。从业经历丰富，2003年初中毕业后深耕美发行业11年，积累了扎实的职业技能与服务经验；2014年起尝试多元发展，涉足摆地摊、房地产等领域，培养了较强的市场适应力与沟通能力；2018年至今经营烤鱼店，全面负责店铺运营，锻炼了统筹管理与抗压能力。个人爱好为越野骑摩托车与锻炼，既能释放活力，也始终保持积极健康的状态。自我评价方面，始终秉持孝顺父母的家庭观念，工作中吃苦耐劳，对待事务富有责任感与担当精神，能以务实态度应对各类挑战。"
    },
    {
    "姓名": "杨坤昌",
    "关系": "杨洪前之子",
    "出生年份": 1988,
    "简介": "杨坤昌，一位生于1988年的专业男性，重庆市巫溪县徐家镇人，是杨洪前之子。他本科学历，毕业于西南财经大学金融学专业，具备扎实的金融理论功底。毕业后，他加入成都农商银行金堂支行，深耕金融领域，凭借专业知识与实践能力逐步成长。目前，他受单位派驻至云南，担任风险部总经理一职，负责区域内金融风险管控相关工作，以专业素养为派驻地区的金融业务稳健发展保驾护航。"
    },
    {
    "姓名": "杨海珍",
    "关系": "杨洪文（安阳）之女",
    "出生年份": 1988,
    "简介": "杨海珍，一位生于1988年的知性女性，重庆市巫溪县徐家镇安阳村人，是杨洪文（安阳）之女。她出身于淳朴农家，家中姐弟三人，排行第二，自幼受传统家风熏陶，熟读家谱，恪守“孝亲敬长、崇文尚学”的家训，养成了端正品性与勤学上进的作风。她的小学至高中阶段均在巫溪本地完成，先后就读于徐家小学、白鹿中学与巫溪中学，2007年考入长江师范学院，于2011年本科毕业，大学期间她积极参与教育实习，积累了初步的教学经验。毕业后，她通过巫溪县教育系统公开招聘，进入巫溪县职业教育中心任教至今，在教学过程中注重因材施教，善于结合职业教育学生的特点开展实践性教学，工作认真负责，深受学生认可。2012年7月，杨海珍与王英俊组建家庭，王英俊生于1986年9月，本科学历，现任巫溪县职业教育中心教导处主任，二人育有一女一子，家庭和睦，彼此支持。生活中，杨海珍热爱旅行与运动，乐于通过行走拓宽视野，以运动保持身心活力，她热心家族事务，积极参与家族文化整理与活动组织，致力于传承家风、凝聚亲情，在子女教育方面注重陪伴与引导，常与孩子共读、参与公益活动，助力他们树立健康积极的价值观。"
    },
    {
    "姓名": "杨柳",
    "关系": "杨繁昌之子",
    "出生年份": 1989,
    "简介": "杨柳，一位学业扎实、职业跨界的男性，重庆市巫溪县人，是杨繁昌之子，他的职业生涯跨越建筑工程与保险两大领域，展现出良好的专业能力与综合素养。他于2005年9月至2008年7月在巫溪县中学校完成高中学业，2008年9月进入重庆大学城市科技学院土木工程专业学习，2012年7月本科毕业，为后续职业发展奠定了坚实的专业基础。2012年6月，杨柳入职重庆万泰建设（集团）有限公司，先后担任施工管理、项目技术等岗位，主要负责工程现场的施工管理、质量与进度控制，积累了扎实的项目实践经验。2016年3月，他转行加入太平人寿保险有限公司重庆分公司，从事保险经纪与代理工作，专注于客户关系维护与保障方案设计，逐步建立起保险服务的专业能力。2019年6月，杨柳重返重庆万泰建设（集团）有限公司，担任项目技术员，负责工程进度跟踪、质量监控及测量收方等具体技术工作。2020年9月至今，他再次回到太平人寿重庆分公司，岗位提升至团队管理与业务销售，统筹团队日常运营，推动业务拓展与绩效提升，展现出跨领域适应力与管理潜力。杨柳兼具土木工程的专业技术背景与保险行业的客户服务、团队管理经验，具备较强的综合素养与多领域协同发展的能力。"
    },
    {
    "姓名": "杨昌俊（柳木）",
    "关系": "杨洪应之子",
    "出生年份": 1990,
    "简介": "杨昌俊，一位生于1990年的技术专家，重庆市巫溪县徐家镇人，是杨洪应之子，是国内冷库技术领域公认的顶尖专家。他初中毕业后入读技校专攻家电维修，后因一次冷库设备维修契机，敏锐捕捉行业潜力，自此深耕冷库领域。凭借“撞南墙不回头”的直爽与“不成功不罢休”的韧劲，他不仅持续突破技术难关，更在重庆创办集冷库设计、安装、维修于一体的专业公司，历经10年打磨，他带领团队将业务拓展至全国，公司成为行业标杆，个人亦手握多项专利。事业之外，杨昌俊始终以反哺社会为己任，针对农村冷链薄弱问题，他多次带队深入重庆周边山区及川渝乡村，免费为农户检修冷库、传授维护知识，还将自研节能专利技术简化后免费提供给农村合作社，降低运营成本、减少农产品损耗；对社区困难家庭，他优先安排技术人员上门维修冷藏设备，常减免费用；同时依托公司实训基地，整理专利与实操经验成教材，为行业新人提供免费培训，助力其就业。虽不善言辞，杨昌俊却以正直品性与务实行动，在技术钻研中守初心、行业深耕中恪本分、公益行动中传温暖，用“讷于言而敏于行”的担当，在专业与社会责任领域留下扎实足迹。"
    },
    {
    "姓名": "杨吉昌",
    "关系": "杨洪文（安阳）之子",
    "出生年份": 1991,
    "简介": "杨吉昌，一位生于1991年的实干男性，重庆市巫溪县徐家镇安阳村1社人，是杨洪文（安阳）之子。他拥有高中文化水平，具备扎实的学习能力与务实的处事态度。在职业选择上，他深受父辈影响，子承父业投身室内外装修行业，目前正处于事业深耕与拓展的关键阶段。从业以来，他始终秉持“品质为先、细节致胜”的理念，从前期设计沟通到后期施工落地，每一个环节都亲力亲为，不仅熟练掌握了装修工艺的核心技术，还积累了丰富的客户服务经验，凭借专业能力与责任心赢得了不少客户的认可。生活中，他注重家庭与家族责任的传承，始终将“为家族发展添力”作为重要目标，在个人成长与事业打拼的同时，他也主动承担家族事务，希望通过持续奋斗，在实现个人事业突破的同时，为家族的长远发展注入更多活力，在行业深耕与家族担当的平衡中稳步前行。"
    },
    {
    "姓名": "杨静",
    "关系": "杨洪轩之女",
    "出生年份": 1991,
    "简介": "杨静，一位生于1991年的务实女性，重庆市巫溪县徐家镇高洪村人，是杨洪轩之女。她成长于基层乡村，自小养成务实坚韧的品格，对家乡发展有着深厚情感与关注。2009年，杨静以优异成绩考入重庆工程学院工程造价专业，本科期间系统学习工程造价管理、工程预算编制、建筑经济等核心课程，打下扎实的专业基础。2013年毕业后，她凭借专业能力与实践积累，先后在工程建设相关领域积累经验，熟练掌握工程造价核算、项目预算把控、成本分析等技能，并考取工程造价、预算相关专业资格证书，为职业发展筑牢根基。目前，杨静任职于巫溪融媒体中心，立足家乡媒体平台，充分发挥自身细致严谨的工作作风与较强的执行力，在新闻采编辅助、项目宣传对接等工作中积极主动，既能以专业视角参与家乡建设相关报道，也能高效完成各项工作任务，为助力巫溪本地信息传播与发展贡献力量。"
    },
    {
    "姓名": "杨號",
    "关系": "杨洪元之子",
    "出生年份": 1991,
    "简介": "杨號，一位生于1991年的踏实男性，重庆市巫溪县徐家镇高洪村人，是杨洪元之子。成长于乡土之间，培养了踏实肯干的性格。2010年，他从巫溪县尖山中学毕业，为追寻更广阔的发展空间，选择外出务工，在多年的打拼中积累了丰富的社会经验与实践能力，更锤炼出极强的抗压与应变特质——面对务工期间的突发任务、创业初期的客源短缺等难题，始终能快速调整思路，以“不慌、不推、不绕”的态度找到破局办法。如今，杨號扎根重庆大学城西永，自主经营一家专注于门窗、隔断及淋浴房的店铺，凭借对产品品质的严格把控、真诚的服务态度，以及这份能扛事、善解决的特质，在当地市场逐步站稳脚跟，用实干书写着属于自己的创业篇章。"
    },
    {
    "姓名": "杨伟",
    "关系": "杨洪建（塘垭）之子",
    "出生年份": 1993,
    "简介": "杨伟，一位生于1993年的技术型男性，重庆市巫溪县徐家镇人，是杨洪建（塘垭）之子，现居重庆市江北区。他于2000年9月至2006年6月在徐家小学就读，2006年9月考入巫溪尖山天宝中学完成初中阶段学习，2009年9月起在巫溪中学就读高中，2012年9月进入重庆大学学习，2016年6月本科毕业。自2018年1月起，杨伟先后在多家知名科技企业担任技术岗位，积累了丰富的软件开发经验，他先于重庆猪八戒网络有限公司担任软件工程师，后于2019年9月加入深圳OPPO有限公司继续从事软件研发工作，2021年4月至今在重庆蚂蚁消费金融有限公司担任高级软件工程师，专业技术能力持续提升，职业发展稳步向前。"
    },
    {
    "姓名": "杨昌茂",
    "关系": "杨洪勇之子",
    "出生年份": 1994,
    "简介": "杨昌茂，一位生于1994年的进取男性，重庆市巫溪县徐家镇高洪村人，是杨洪勇之子。他学历扎实且职业方向清晰。2016年，他毕业于重庆邮电大学移通学院，在校期间系统学习专业课程，构建了稳固的知识根基；2024年，他凭借对公共管理领域的热忱，考入青海民族大学公共管理专业攻读研究生，专注钻研基层治理、政策分析等核心内容，着力提升公共服务与管理的专业素养。目前，杨昌茂任职于四川省资阳市乐至县宝林镇人民政府，在基层岗位上积极融合专业知识与工作实践，日常参与政务处理、政策落实与民生服务等事务，以务实作风服务地方发展，扎实履行公共管理职责，稳步推进职业成长。"
    },
    {
    "姓名": "杨文波",
    "关系": "杨银昌（柳木）之子",
    "出生年份": 1998,
    "简介": "杨文波，一位生于1998年的有为青年，重庆市巫溪县徐家镇高洪村人，是杨银昌（柳木）之子，属“文”字辈。少承家教，于简朴家境中养成坚韧与感恩之品格。自徐家小学启蒙，继入巫溪城乡中学、重庆铁路中学；本科就读重庆大学，获工学学士；后于上海大学深造，获工学硕士。自小至研学业精进，曾获“三好学生”“五好学生”“优秀学生干部”“优秀团员”等荣誉，并在数学建模及多项专业竞赛中屡有佳绩。成长之途，家计不裕，由祖母含辛茹苦抚育成人，其铭记“再穷不能穷教育”之训，砥砺自立自强、以学立身。在校期间，除潜心学业，亦积极任事：先后担任重庆大学班级学习委员、生活委员及校宣传部副部长；于上海大学出任学院实践部部长，组织策划数十场院校活动，注重协同与实效，获师生赞誉。在师友评价中，其为人谦和诚笃、治学严谨、思维活跃，能以创新视角解决问题，并善于统筹协作、勇于承担责任。现就职于重庆塞力斯汽车有限公司，投身智能制造与新能源汽车产业实践。面向未来，拟继续深造，于工学相关领域深耕细作，以专业所长服务社会、反哺乡里；不负长者期许，不坠家风之传。其成长轨迹，既为个人砥砺奋进之注脚，亦为新时代家族精神之生动注解。族中长者评曰：“此子沉稳自励，眼里有光、脚下有路。”"
    },
    {
    "姓名": "杨帆",
    "关系": "杨云昌之女",
    "出生年份": 2000,
    "简介": "杨帆，一位生于2000年的勤勉女性，重庆市巫溪县人，是杨云昌之女。自幼勤勉好学、志存高远，成长轨迹始终与“笃学”“担当”相伴。学业上，她稳步进阶：2006年入读徐家中心小学校，2012年升入白鹿初级中学校，2015年考入巫溪县中学校，一路砥砺品行、专注学业；2018年成功考入重庆科技学院环境工程专业后，依旧刻苦钻研、敏于求知，2022年顺利毕业并获工学学士学位，为职业发展打下扎实专业基础。职业选择上，她始终以“服务”为导向：2022年7月入职重庆阳正环保科技股份有限公司，担任报告编制员，以严谨务实的态度投身环保事业，展现出优秀的专业素养与实践能力；2023年初，为更好地服务社会、奉献基层，她毅然辞去企业工作，潜心备考公务员，历经努力，于2024年7月通过重庆市公务员考试，入职巫溪县胜利乡人民政府，成为扎根乡村、服务群众的人民公仆。杨帆不仅秉承家风、积极向上，更以勤勉诚恳立身、尽责担当履职，她不忘初心、脚踏实地，用行动诠释了新时代青年奋发有为、甘于奉献的精神风貌，是族中子弟学习的楷模。"
    }
  ],


  "跋": "若后世见此谱有未备之处，盼贤达考订补遗，使吾族谱系愈臻完善。当最后一笔落下，这册族谱便成了跨越时光的桥——一头连着先辈的足迹，一头系着后人的凝望。纸页间的每一个名字，都曾是鲜活的生命：有过清晨的忙碌，有过黄昏的牵挂，有过顺遂时的笑意，也有过困顿中的坚守。他们的故事，或许未被史书浓墨重彩，却在家族的血脉里刻下了深深的印记。\n\n此刻，我们将这些印记郑重收起，并非为了沉溺过往，而是要让后来者知道：自己站在怎样的肩膀上，承继着怎样的力量。\n愿此后岁月，凡我族人翻开此谱，能见先祖之德，明自身之责；能于他乡遇族人时，一句“同根”便胜却千言；能在人生歧路处，忆家训之嘱，行正道之光。\n\n族谱有尽，传承无尽。愿我家族，如江河奔涌，代代不息；如松柏长青，世世芬芳。\n\n今此族谱告成，纵观全卷，上溯先祖开基之艰，下录新支繁衍之盛，其间虽竭尽所能，然世事变迁，支脉日繁，或有阙漏，实难尽免，虽力求完备，仍恐有疏漏。使字辈所载之志、所寄之情，历久弥新。愿吾族后人展此谱时，一者念祖德之厚，思创业维艰，常怀感恩之心；二者悟家风之正，明族规之严，以正言行、端品行；三者观支脉之亲，知血脉相连，无论散居何地，皆存“一本同源”之念，同心协力，共护家声。"
}

